{
     "pages":[
          {"title":"Home", "hash":"Home", "content":[
               {"$type":"text", "innerHTML":"<p>During 2013 I started to look at myself and get really down about who was staring back at me in the mirror. I also felt sluggish and occasionally I would get pains in my chest and arm. This led me to think that maybe something needed to be done about my weight to the point that I started trying to lose weight.</p><p>I was a whopping 225 Lbs. when I started, and my Fiance convinced me that I should do Weight Watchers with her. The weight came of slowly but steadily for the first few months. Even over Thanksgiving I was able to lose a bit of weight. I started around August and by January I had lost almost 30 Lbs. I started feeling so good that I decided it might be time to try working out as well. So I ditched Weight Watchers, and just started tracking my calories with My Fitness Pal.</p><p>Once I joined My Fitness Pal, the weight started to melt away. Through a combination of Portion control, exercise, and eating right I lost another 15 pounds in the next 3 months. I started exercising by going to the Gym, but eventually I ended up setting up a workout area in our loft and purchasing GSP Rushfit. This kit was amazing for getting my energy up, toning my body, and imrpoving my overall mobility as well as shed some poundage. I lost a pound a week during the 8 week program, and I was able to run a 27 minute 5k to boot. I highly recommend this workout to anyone who is looking to improve their overall fitness.</p><p>Now that I am at a healthy weight and eating properly to maintain it, I decided it might be time to put on some muscle. Given the sucess with Rushfit, I decided to try Body Beast. This kit is designed specifically around building mass. I worked my way through it and definitely could see the gains. I am extremely happy with the results from both programs and intend on doing them again. If you are like me and need to lose some weight, I highly suggest the methods I chose as a way to healthily do it.</p><ul><li>Portion Control - If you are not hungry, stop trying to finish off the stuff on your plate</li><li>Calorie Deficit - Make sure you are losing a healthy 1 lbs. a week, otherwise the chances the weight will return are high.</li><li>Exercise - Do what you can, find a workout that works for you, but make sure you challenge yourself.</li><li>Perseverance - If you say \"Today is my cheat day\", you are doing it wrong; commit to your program so that you can maximize your results!</li></ul>"}
               ]
          }
     ]
}