{"pages":[{"title":"PC Gaming", "src":"./content/pc.json", "hash":"PC", "content":[{"$type":"text", "innerHTML":"I am a PC gamer. I prefer it over the other platforms because the Keyboard+mouse provide much more control within games. On top of that, Steam is a tremendous platform which is unmatched on consoles because of their seamless integration of features and wonderful sales. Combine all that power with ability to customize every part in your Rig and you can have a gaming experience unique to each user."},
{"$type":"text", "innerHTML":"My history in PC games is pretty extensive. I started PC gaming as a young kid when the games came on Disk. I relied on my dad to load things up for me, but I enjoyed playing the simple games of the day. My first real foray into PC games was with the original Diablo and Age of Empires. I also thoroughly enjoyed Command and Conquer, and really got into Red Alert. Over time I kept up with the RPG and RTS genre for the most part. I moved on to play Red Alert 2 and put a ton of hours into Yuri's revengs. I also still play Diablo 2 and found that game to be the pinnacle of my early teen years gaming experience."},
{"$type":"text", "innerHTML":"My tastes evolved over time and I played many different genres, but the one that keeps me most interested are MMOs. Fist big game I played was Ultima Online. I remember dropping countless hours in that game trying to tame the best dragon and tackle the hardest dungeons. Eventually I got tired of the Gameplay and moved onto other games. Star Wars Galaxies was the next big thing, and I remember my PC barely being able to handle it. I still loved it so much playing as my Wookie. Eventually I opted for a Zabrak TKM/Doctor though, last time I played a Flavor of the Month class that I can remember. City of Heroes was the next game I tried. I really enjoyed it, for the most part. I never got to level cap even after playing it for several months, I just had so much fun making new heroes and all of the different playstyles were so much fun. Of course, the monster came out next which would claim more than just thousands of hours of my life: World of Warcraft."},
{"$type":"text", "innerHTML":"WoW was a genre definer for me. The game was just so Epic, and the playstyle was so fresh and new coming from a SWG/CoH background. In the other games, buffs only lasted a few minutes, but in this one they could last 30! I rolled a Druid because, bear. I loved the game world, and even though it only ran at 3FPS, I still played the crap out of it. I started off Alliance but eventually went Horde and got my Mage to cap the same day I graduated High school. The game was just to good to put down and I made the best friend I ever had within a game during Vanilla. It even claimed my first Fiance due to it's strong hold on me. I learned from that though and now know to definitely moderate my play time."},
{"$type":"text", "innerHTML":"After WoW, I ping pongged between CoH and SWG when the expansions kept coming out. I enjoyed the new Space combat in SWG, but nothing kept me satisfied like WoW. I tried DDO with my dad, and it was fun but not enough. I played EQ2 with a friend, but it was not enough. I played Hellgate: London, Tabula Rasa, Lord of the Rings Online, Age of Conan, Champions, DC Universe Online, and nothing was keeping my attention for more than the initial month. Then I got back into WoW for Wrath of the Lich King and was playing for upwards to 100 hours a week doing progression raiding. I always describe my best time in College as the semester unemployed playing WoW as my \"Job\", and I was always happy to log in until the end. Luckily Rift dropped just in time for me to drop my subscription to WoW."},
{"$type":"text", "innerHTML":"Rift was a nice game to transition to. It was basically WoW with HD graphics and dynamic events. The gameplay was nothing new, but I did not want it to be. The class system is still what I consider one of the best in the Genre providing an extreme amount of customization on each of your characters. I played the game for a good amount fo time, but got tired and went back to SWG. I actually enjoyed the post NGE enhancements and still thought the Space combat was second to none. Eventually Cataclysm dropped and I once again went back to WoW for a short amount of time. I raided the first tier, but got tired of it and moved on."},
{"$type":"text", "innerHTML":"After all these games, I took a break from MMOs for a bit and enjoyed the games I skipped over due to not having enough \"time\". I came back with Star Wars: The old Republic, but it was not enough to keep me interested. When Mists of Pandaria dropped, I was not impressed. I was starting to get the itch though so I tried Planetside 2. I thoroughly recommend this game if you are interested in FPSs and MMOs like I am. After this I tried Tera, Guild Wars 2, went back to Rift, and WoW; but now I am not playing games from the past. My current focus is WildStar, and I am playing a bunch of others again including Guild Wars 2, The Secret World, Final Fantasy XIV. I am in a Progression guild in Wildstar, but only as a casual member. I hope these games can keep me going, but for the most part they have been very enjoyable."}]},
{"title":"Playstation 4 Gaming", "src":"./content/ps4.json","hash":"PS4", "content":[{"$type":"text", "innerHTML":"PS4 GAMING SECTION"}]}
]}