{ "pages":[{"title":"Ian and Stacy's Wedding Homepage","hash":"Wedding", "content":[
    {"$type":"text", "innerHTML":"<p>Welcome to Ian and Stacy's wedding homepage. This page will contain all the information you need to know about their upcoming wedding on October 18th. First things you need to know:</p><ul><li>The wedding is on October 18th, 2014</li><li>The wedding is in Austin Texas at <a href='http://www.dunvegankeep.com/' title='Dunvegan Keep Website' target='_new'>Dunvegan Keep</a></li><li>The ceremony is currently slated to start at 430 P.M. and should last 45 mins</li><li>The reception will be at the same location and is tentatively scheduled to begin at 630 P.M.</li><li>The reception will end around 930 P.M.</li><li>Dress code is less than formal but more than casual. Think business casual or church clothes.</li></ul>"},
    {"$type":"text", "innerHTML":"On the day of the ceremony, parking will be at the nearby school, see the map below for more details. Guests should park at the school and take the complimentary shuttle to the venue. The ceremony will be outdoors. Hopefully since the wedding is being held in October, Austin's dryest month, there will be no rain and temperatures should not be unbearable. The venue has been kind enough to offer complimentary water for guests on the day of the event."},
    {"$type":"text", "innerHTML":"<iframe width='460px' height='380px' src='./wedding/map.html'></iframe> <br /> <a href='./wedding/map.html' target='_blank'>Open in new window</a>", "style":"text-align:center;"},
    {"$type":"text", "innerHTML":"<p>Now onto the details about the Reception! Catering will be provided by Pok-E-Jo's Texas BBQ. We have chosen a selection of 3 meats and 4 sides which will be served buffet style:</p><ul><li>Entrees:<ul><li>Beef Brisket</li><li>Spicy Sausage</li><li>Chicken</li></ul></li><li>Sides:<ul><li>Mac-n-Cheese</li><li>Side2</li><li>Side3</li><li>Side4</li></ul></li></ul><p>Dessert will be a mixture of Cupcakes and a Naked cake. Ian has also splurged and asked the have chocolate pudding something or the other, good luck getting some from him.</p>"},
    {"$type":"text", "innerHTML":"Thank you all for sharing this day in our lives with us. It means a lot to Stacy that you are coming! Ian is just stoked he gets to stuff his face with the rest of you. We hope that you enjoy the wedding, we just hope it goes well!"}
    ]}
]}